class Content {
  static final List<Map<String, dynamic>> vowels = [
    {
      'letter': '𑄃',
      'pronunciation': 'পিছপুজা-আ',
      'word': 'আনারস',
      'chakmaWord': 'আনাজ (𑄥𑄕𑄎𑄧)',
      'rules': 'চাকমা ভাষায় স্বরবর্ন মাত্র ১টি (পিচপুঝা-আ)।'
    },
  ];

  static final List<Map<String, dynamic>> consonants = [
    {
      'letter': '𑄇',
      'pronunciation': 'চুচ্যাঙা - কা',
      'word': 'কাক',
      'chakmaWord': 'হাক (𑄇𑄇)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ কিছুটা "কা" এবং "হা" এর মাঝামাঝি হবে। কাক্কি > হাক্কি শব্দের মাঝে বা শেষে থাকলে উচ্চারণ "গা" এর মত হবে। একর > এগর'
    },
    {
      'letter': '𑄈',
      'pronunciation': 'গুজঙ্যা - খা',
      'word': 'খবর',
      'chakmaWord': 'হবর (𑄈𑄈𑄈)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ কিছুটা "খা" এবং "হা" এর মাঝামাঝি হবে। খাদি > হাদি শব্দের মাঝে বা শেষে থাকলে উচ্চারণ "ঘা" এর মত হবে। চোখ > চোঘ'
    },
    {
      'letter': '𑄉',
      'pronunciation': 'চান্দ্যা - গা',
      'word': 'গান',
      'chakmaWord': 'গান (𑄉𑄉)',
      'rules': 'উচ্চারণ স্বাভাবিক "গা" এর মত হবে।'
    },
    {
      'letter': '𑄊',
      'pronunciation': 'তিনধাল্যা - ঘা',
      'word': 'ঘর',
      'chakmaWord': 'ঘর (𑄊𑄊)',
      'rules': 'উচ্চারণ স্বাভাবিক "ঘা" এর মত হবে।'
    },
    {
      'letter': '𑄋',
      'pronunciation': 'চিলাম - ঙা',
      'word': 'নগর',
      'chakmaWord': 'ঙগর (𑄋𑄋𑄋)',
      'rules': 'উচ্চারণ স্বাভাবিক "ঙা" এর মত হবে।'
    },
    {
      'letter': '𑄌',
      'pronunciation': 'দ্বিধাল্যা - চা',
      'word': 'চোখ',
      'chakmaWord': 'চোঘ (𑄌𑄌)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ কিছুটা "চা" এবং "সা" এর মাঝামাঝি হবে। শব্দের মাঝে বা শেষে থাকলে উচ্চারণ "জা" এর মত হবে। বেচাকেনা > বেজাহেনা'
    },
    {
      'letter': '𑄍',
      'pronunciation': 'মজরা - ছা',
      'word': 'মাছ',
      'chakmaWord': 'মাঝ (𑄍𑄍)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "ছা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "জা" এর মত হবে।'
    },
    {
      'letter': '𑄎',
      'pronunciation': 'দ্বিপদলা - জা',
      'word': 'জল',
      'chakmaWord': 'জল (𑄎𑄎)',
      'rules': 'উচ্চারণ স্বাভাবিক "জা" এর মত হবে।'
    },
    {
      'letter': '𑄏',
      'pronunciation': 'উরউরি - ঝা',
      'word': 'ঝড়',
      'chakmaWord': 'ঝড় (𑄏𑄏)',
      'rules': 'উচ্চারণ স্বাভাবিক "ঝা" এর মত হবে।'
    },
    {
      'letter': '𑄐',
      'pronunciation': 'চিলচ্যা - ঞা',
      'word': 'জ্ঞ',
      'chakmaWord': 'জ্ঞ (𑄐𑄐)',
      'rules': 'উচ্চারণ স্বাভাবিক "ঞা" এর মত হবে।'
    },
    {
      'letter': '𑄑',
      'pronunciation': 'দ্বয়াদাত - টা',
      'word': 'টাকা',
      'chakmaWord': 'ডাকা (𑄑𑄑)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "টা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ডা" এর মত হবে।'
    },
    {
      'letter': '𑄒',
      'pronunciation': 'ফুদাদিয়াত - ঠা',
      'word': 'ঠান্ডা',
      'chakmaWord': 'ডান্ডা (𑄒𑄒)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "টা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ডা" এর মত হবে।'
    },
    {
      'letter': '𑄓',
      'pronunciation': 'আদুভাঙাত - ডা',
      'word': 'ডাল',
      'chakmaWord': 'ডাল (𑄓𑄓)',
      'rules': 'উচ্চারণ স্বাভাবিক "ডা" এর মত হবে।'
    },
    {
      'letter': '𑄔',
      'pronunciation': 'লেজভরাত - ঢা',
      'word': 'ঢাকা',
      'chakmaWord': 'ঢাকা (𑄔𑄔)',
      'rules': 'উচ্চারণ স্বাভাবিক "ঢা" এর মত হবে।'
    },
    // {
    //   'letter': '𑄕',
    //   'pronunciation': 'পেত্তুয়া - ণা',
    //   'word': 'জনা',
    //   'chakmaWord': 'জনা (𑄕𑄕)',
    //   'rules': 'উচ্চারণ স্বাভাবিক "ণা" এর মত হবে।'
    // },
    {
      'letter': '𑄖',
      'pronunciation': 'ঘঙদাত - তা',
      'word': 'কথা',
      'chakmaWord': 'হধা (𑄖𑄖)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ "তা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ধা" এর মত হবে।'
    },
    {
      'letter': '𑄗',
      'pronunciation': 'জগদাত - থা',
      'word': 'কথা',
      'chakmaWord': 'হধা (𑄗𑄗)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ "থা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ধা" এর মত হবে।'
    },
    {
      'letter': '𑄘',
      'pronunciation': 'দোলনিত - দা',
      'word': 'দা',
      'chakmaWord': 'দা (𑄘𑄘)',
      'rules': 'উচ্চারণ স্বাভাবিক "দা" এর মত হবে।'
    },
    {
      'letter': '𑄙',
      'pronunciation': 'তলমুয়াত - ধা',
      'word': 'ধরা',
      'chakmaWord': 'ধরা (𑄙𑄙)',
      'rules': 'উচ্চারণ স্বাভাবিক "ধা" এর মত হবে।'
    },
    {
      'letter': '𑄚',
      'pronunciation': 'ফারবান্যা - না',
      'word': 'না',
      'chakmaWord': 'না (𑄚𑄚)',
      'rules': 'উচ্চারণ স্বাভাবিক "না" এর মত হবে।'
    },
    {
      'letter': '𑄛',
      'pronunciation': 'পাল্যা - পা',
      'word': 'পাপ',
      'chakmaWord': 'বাব (𑄛𑄛)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "পা" এবং "হা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "বা" এর মত হবে।'
    },
    {
      'letter': '𑄜',
      'pronunciation': 'উবরপদলা - ফা',
      'word': 'ফল',
      'chakmaWord': 'ফল (𑄜𑄜)',
      'rules': 'উচ্চারণ স্বাভাবিক "ফা" এর মত হবে।'
    },
    {
      'letter': '𑄝',
      'pronunciation': 'উবরমুয়া - বা',
      'word': 'বাতাস',
      'chakmaWord': 'বাতাস (𑄝𑄝)',
      'rules': 'উচ্চারণ স্বাভাবিক "বা" এর মত হবে।'
    },
    {
      'letter': '𑄞',
      'pronunciation': 'চেইরধাল্যা - ভা',
      'word': 'ভাব',
      'chakmaWord': 'ভাব (𑄞𑄞)',
      'rules': 'উচ্চারণ স্বাভাবিক "ভা" এর মত হবে।'
    },
    {
      'letter': '𑄟',
      'pronunciation': 'বুগত পদলা - মা',
      'word': 'মা',
      'chakmaWord': 'মা (𑄟𑄟)',
      'rules': 'উচ্চারণ স্বাভাবিক "মা" এর মত হবে।'
    },
    {
      'letter': '𑄠',
      'pronunciation': 'চিমোজ্যা - য়া',
      'word': 'যা',
      'chakmaWord': 'যা (𑄠𑄠)',
      'rules': 'উচ্চারণ স্বাভাবিক "য়া" এর মত হবে।'
    },
    {
      'letter': '𑄡',
      'pronunciation': 'জিল্যা - যা',
      'word': 'যাক',
      'chakmaWord': 'যাক (𑄡𑄡)',
      'rules': 'উচ্চারণ স্বাভাবিক "যা" এর মত হবে।'
    },
    {
      'letter': '𑄢',
      'pronunciation': 'দ্বিদায্যা - রা',
      'word': 'রাম',
      'chakmaWord': 'রাম (𑄢𑄢)',
      'rules': 'উচ্চারণ স্বাভাবিক "রা" এর মত হবে।'
    },
    {
      'letter': '𑄣',
      'pronunciation': 'তল্মুঅ - লা',
      'word': 'লাল',
      'chakmaWord': 'লাল (𑄣𑄣)',
      'rules': 'উচ্চারণ স্বাভাবিক "লা" এর মত হবে।'
    },
    {
      'letter': '𑄤',
      'pronunciation': 'বাঝোন্যা - ওয়া',
      'word': 'ওয়াব',
      'chakmaWord': 'ওয়াব (𑄤𑄤)',
      'rules': 'উচ্চারণ স্বাভাবিক "ওয়া" এর মত হবে।'
    },
    {
      'letter': '𑄥',
      'pronunciation': 'ভুদিবুক্যা - সা',
      'word': 'সার',
      'chakmaWord': 'সার (𑄥𑄥)',
      'rules': 'উচ্চারণ স্বাভাবিক "সা" এর মত হবে।'
    },
    {
      'letter': '𑄦',
      'pronunciation': 'উবরমুঅ - হা',
      'word': 'হাসি',
      'chakmaWord': 'হাসি (𑄦𑄦)',
      'rules': 'উচ্চারণ স্বাভাবিক "হা" এর মত হবে।'
    }
  ];
}
