class Content {
  static final List<Map<String, dynamic>> vowels = [
    {
      'letter': '𑄃',
      'pronunciation': 'পিছপুজা-আ',
      'word': 'আনারস',
      'chakmaWord': 'আনাজ (𑄥𑄕𑄎𑄧)',
      'rules': 'চাকমা ভাষায় স্বরবর্ন মাত্র ১টি (পিচপুঝা-আ)।'
    },
  ];

  static final List<Map<String, dynamic>> consonants1 = [
    {
      'letter': '𑄇',
      'pronunciation': 'চুচ্যাঙা - কা',
      'word': 'কাক',
      'chakmaWord': 'কবা (𑄇𑄧𑄝)',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ কিছুটা "কা" এবং "হা" এর মাঝামাঝি হবে। কবা > হবা শব্দের মাঝে বা শেষে থাকলে উচ্চারণ "গা" এর মত হবে। একর > এগর'
    },
    {
      'letter': '𑄈',
      'pronunciation': 'গুজঙ্যা - খা',
      'word': 'খাতা',
      'chakmaWord': 'খাদা',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ কিছুটা "খা" এবং "হা" এর মাঝামাঝি হবে। খাদা > হাদা শব্দের মাঝে বা শেষে থাকলে উচ্চারণ "ঘা" এর মত হবে। রাখ্যল > রাঘ্যল'
    },
    {
      'letter': '𑄉',
      'pronunciation': 'চান্দ্যা - গা',
      'word': 'নদী',
      'chakmaWord': 'গাঙ',
      'rules': 'উচ্চারণ স্বাভাবিক "গা" এর মত হবে।'
    },
    {
      'letter': '𑄊',
      'pronunciation': 'তিনধাল্যা - ঘা',
      'word': 'কঠিন',
      'chakmaWord': 'আঘাত্যা',
      'rules': 'উচ্চারণ স্বাভাবিক "ঘা" এর মত হবে।'
    },
    {
      'letter': '𑄋',
      'pronunciation': 'চিলাম - ঙা',
      'word': 'স্রোত',
      'chakmaWord': 'গঙার',
      'rules': 'উচ্চারণ স্বাভাবিক "ঙা" এর মত হবে।'
    },
    {
      'letter': '𑄌',
      'pronunciation': 'দ্বিধাল্যা - চা',
      'word': 'চালুনী',
      'chakmaWord': 'চালোন',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ কিছুটা "চা" এবং "সা" এর মাঝামাঝি হবে। শব্দের মাঝে বা শেষে থাকলে উচ্চারণ "জা" এর মত হবে। গাছ >গাচ,গাজ'
    },
    {
      'letter': '𑄍',
      'pronunciation': 'মজরা - ছা',
      'word': 'ছাতা',
      'chakmaWord': 'ছাদি',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "ছা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "জা" এর মত হবে। ঘামাচি> ঘামবিছি, ঘামবিজি'
    },
    {
      'letter': '𑄎',
      'pronunciation': 'দ্বিপদলা - জা',
      'word': 'ইতিহাস',
      'chakmaWord': 'বিজোক',
      'rules': 'উচ্চারণ স্বাভাবিক "জা" এর মত হবে।'
    },
  ];

  static final List<Map<String, dynamic>> consonants2 = [
    {
      'letter': '𑄏',
      'pronunciation': 'উরউরি - ঝা',
      'word': 'শীঘ্র',
      'chakmaWord': 'ঝাদি',
      'rules': 'উচ্চারণ স্বাভাবিক "ঝা" এর মত হবে।'
    },
    {
      'letter': '𑄐',
      'pronunciation': 'চিলচ্যা - ঞা',
      'word': 'বোধ',
      'chakmaWord': 'বাম-ইঞ্জেব',
      'rules': 'উচ্চারণ স্বাভাবিক "ঞা" এর মত হবে।'
    },
    {
      'letter': '𑄑',
      'pronunciation': 'দ্বয়াদাত - টা',
      'word': 'টেবিল',
      'chakmaWord': 'টেবিল',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "টা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ডা" এর মত হবে। হাটু> আদু'
    },
    {
      'letter': '𑄒',
      'pronunciation': 'ফুদাদিয়াত - ঠা',
      'word': 'কাঁঠাল',
      'chakmaWord': 'কাঠ্যল',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "টা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ডা" এর মত হবে।'
    },
    {
      'letter': '𑄓',
      'pronunciation': 'আদুভাঙাত - ডা',
      'word': 'কচ্ছপ',
      'chakmaWord': 'ডুর',
      'rules': 'উচ্চারণ স্বাভাবিক "ডা" এর মত হবে।'
    },
    {
      'letter': '𑄔',
      'pronunciation': 'লেজভরাত - ঢা',
      'word': 'ঢাকনি',
      'chakmaWord': 'ঢাগোনী',
      'rules': 'উচ্চারণ স্বাভাবিক "ঢা" এর মত হবে।'
    },
    // {
    //   'letter': '𑄕',
    //   'pronunciation': 'পেত্তুয়া - ণা',
    //   'word': 'বিশ্রাম',
    //   'chakmaWord': 'জিরাণ',
    //   'rules': 'উচ্চারণ স্বাভাবিক "ণা" এর মত হবে।'
    // },
    {
      'letter': '𑄖',
      'pronunciation': 'ঘঙদাত - তা',
      'word': 'জলপ্রপাত',
      'chakmaWord': 'তামঝাং',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ "তা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ধা" এর মত হবে। পাতা > পাদা, পাধা'
    },
  ];

  static final List<Map<String, dynamic>> consonants3 = [
    {
      'letter': '𑄗',
      'pronunciation': 'জগদাত - থা',
      'word': 'থালা',
      'chakmaWord': 'থাল',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ "থা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "ধা" এর মত হবে।'
    },
    {
      'letter': '𑄘',
      'pronunciation': 'দোলনিত - দা',
      'word': 'জুতো',
      'chakmaWord': 'জদা',
      'rules': 'উচ্চারণ স্বাভাবিক "দা" এর মত হবে।'
    },
    {
      'letter': '𑄙',
      'pronunciation': 'তলমুয়াত - ধা',
      'word': 'প্রস্থ',
      'chakmaWord': 'পাধাচ্যা',
      'rules': 'উচ্চারণ স্বাভাবিক "ধা" এর মত হবে।'
    },
    {
      'letter': '𑄚',
      'pronunciation': 'ফারবান্যা - না',
      'word': 'প্রার্থনা',
      'chakmaWord': 'তবনা',
      'rules': 'উচ্চারণ স্বাভাবিক "না" এর মত হবে।'
    },
    {
      'letter': '𑄛',
      'pronunciation': 'পাল্যা - পা',
      'word': 'চোখের পাতা',
      'chakmaWord': 'চোঘঅ পাদা',
      'rules':
          'শব্দের শুরুতে থাকলে উচ্চারণ স্বাভাবিক "পা" এবং "হা" এর মত হবে। শব্দের শেষে থাকলে উচ্চারণ "বা" এর মত হবে।'
    },
    {
      'letter': '𑄜',
      'pronunciation': 'উবরপদলা - ফা',
      'word': 'ফল',
      'chakmaWord': 'ফল ',
      'rules': 'উচ্চারণ স্বাভাবিক "ফা" এর মত হবে।'
    },
    {
      'letter': '𑄝',
      'pronunciation': 'উবরমুয়া - বা',
      'word': 'খোসা',
      'chakmaWord': 'বাগল',
      'rules': 'উচ্চারণ স্বাভাবিক "বা" এর মত হবে।'
    },
    {
      'letter': '𑄞',
      'pronunciation': 'চেইরধাল্যা - ভা',
      'word': 'ছায়া',
      'chakmaWord': 'ছাভা',
      'rules': 'উচ্চারণ স্বাভাবিক "ভা" এর মত হবে।'
    },
  ];
  static final List<Map<String, dynamic>> consonants4 = [
    {
      'letter': '𑄟',
      'pronunciation': 'বুগত পদলা - মা',
      'word': 'পাহাড়',
      'chakmaWord': 'মোন',
      'rules': 'উচ্চারণ স্বাভাবিক "মা" এর মত হবে।'
    },
    {
      'letter': '𑄠',
      'pronunciation': 'চিমোজ্যা - য়া',
      'word': 'পাখির ডানা',
      'chakmaWord': 'পেঘঅ ডুয়ো',
      'rules': 'উচ্চারণ স্বাভাবিক "য়া" এর মত হবে।'
    },
    {
      'letter': '𑄡',
      'pronunciation': 'জিল্যা - যা',
      'word': 'সূর্যমুখী',
      'chakmaWord': 'সুয্যমুখি',
      'rules': 'উচ্চারণ স্বাভাবিক "যা" এর মত হবে।'
    },
    {
      'letter': '𑄢',
      'pronunciation': 'দ্বিদায্যা - রা',
      'word': 'খেলা',
      'chakmaWord': 'খারা',
      'rules': 'উচ্চারণ স্বাভাবিক "রা" এর মত হবে।'
    },
    {
      'letter': '𑄣',
      'pronunciation': 'তল্মুঅ - লা',
      'word': 'লাল',
      'chakmaWord': 'লাল (𑄣𑄣)',
      'rules': 'উচ্চারণ স্বাভাবিক "লা" এর মত হবে।'
    },
    {
      'letter': '𑄤',
      'pronunciation': 'বাঝোন্যা - ওয়া',
      'word': 'অক্ষর',
      'chakmaWord': 'ওক্কোর',
      'rules': 'উচ্চারণ স্বাভাবিক "ওয়া" এর মত হবে।'
    },
    {
      'letter': '𑄥',
      'pronunciation': 'ভুদিবুক্যা - সা',
      'word': 'আলো',
      'chakmaWord': 'সদক',
      'rules': 'উচ্চারণ স্বাভাবিক "সা" এর মত হবে।'
    },
    {
      'letter': '𑄦',
      'pronunciation': 'উবরমুঅ - হা',
      'word': 'হাতুড়ি',
      'chakmaWord': 'হাদুরো',
      'rules': 'উচ্চারণ স্বাভাবিক "হা" এর মত হবে।'
    }
  ];
}
