Repository: junechakma/Changma_Bhach--Flutter-Based-Chakma-Language-Learning-App
Catalog: lib/l10n/app_*.arb
Languages: bn

# appName
source: Changma Bhach
bn: চাঙমা ভাচ

# welcomeMessage
source: Welcome to the app for learning Chakma language and letters!
bn: জু জু, চাকমা ভাষা ও অক্ষর শেখার অ্যাপ এ আপনাকে স্বাগতম !

# enter
source: Get Inside
bn: প্রবেশ করুন

# lesson
source: Ojhapath
bn: অঝাপাঠ

source: Others
bn: অন্যান্য

source: Vowel
bn: স্বরবর্ণ

# vowelChakma
source: Gaimattyapath
bn: গাইমাত্যা অহ্’রক

source: Consonant
bn: ব্যঞ্জনবর্ণ

# consonantChakma
source: Balemattyapath
bn: বলেমাত্যা অহ্’রক

source: Diacritics
bn: অণুচিহ্ন

# diacriticsChakma
source: Majarapath
bn: মাজারা পাত

source: Numerals
bn: সংখ্যা

# numeralsChakma
source: Nadapath
bn: নাদা পাত

# bottomBarHome
source: Home
bn: হোম

# bottomBarTranslations
source: Translations
bn: ট্রান্সলেশন

# bottomBarReport
source: Report
bn: রিপোর্ট

# confirm_exit_title
source: Confirm Exit
bn: প্রস্থান নিশ্চিত করুন

# confirm_exit_message
source: Do you really want to go to home?
bn: আপনি কি সত্যিই হোম পেজে যেতে চান?

# cancel_button
source: Cancel
bn: বাতিল করুন

# yes_button
source: Yes
bn: হ্যাঁ

# draw_button
source: Draw
bn: আঁকুন

# draw_bellow
source: Draw the character bellow
bn: নিচে অক্ষরটি আঁকুন

# clear_button
source: Clear
bn: মুছুন

# prediction_button
source: Check
bn: যাচাই করুন

# error_drawing_message
source: Incorrect character, please try again!
bn: ভুল অক্ষর, আবার চেষ্টা করুন!

# congratulation_message
source: Congratulations!
bn: অভিনন্দন!

# congratulation_alert_message
source: What would you like to do next?
bn: এরপর কি করতে চাও?

# congratulation_alert_result_button
source: Result
bn: ফলাফল

# congratulation_alert_restart_button
source: Retry
bn: পুনরায় আঁকুন

# congratulation_alert_next_button
source: Next Lesson
bn: পরের অক্ষর

# proverbTitle
source: Proverb
bn: প্রবাদ

# proverb1
source: Agha ele baghore dor nei, pada ele rajar laj nei.
bn: আঘা এলে বাঘরে দর নেই, পাদা এলে রাজারে লাজ নেই।

# proverb2
source: Jade jad togay, hangara gad togay.
bn: জাদে জাদ তগায়, হাঙারা গাদ তগায়।

# proverb3
source: Tagol dadottun samei dangor.
bn: টাগল দাদত্তুন সামেই দাঙর।

# proverb4
source: Dugottun ogoman dangor.
bn: দুগত্তুন অগমান দাঙর।

# proverb5
source: Dhorimme jeda, erimme mora.
bn: ধরিম্মে জেদা, এরিম্মে মরা।

# proverb6
source: Duj hele ujh bare.
bn: দুজ্‌ হেলে উজ্‌ বারে।

# proverb7
source: Nijo alu nije hure.
bn: নিজো আলু নিজে হুরে।

# proverb8
source: Nijo bhat hei por goru sorana.
bn: নিজো ভাত হেই পর গরু চড়ানা।

# proverb9
source: Nei mogottun han mok bhala, shobai no padhe rajar jhi bhala.
bn: নেই মগত্তুন হান মোক ভালা, সবাই নঅ পাদে রাজার ঝি ভালা।

# proverb10
source: Panit dhubi agana.
bn: পানিত ঢুবি আগানা।

# proverb11
source: Bandorror hi al chora.
bn: বান্দরর হি আল ছরা।

# proverb12
source: Bala dharele bala pai, dharayee bala hudu jay.
bn: বালা ধারেলে বালা পাই, ধারেয়ে বালা হুদু যায়।

# proverb13
source: Boidyottun pothyo bej.
bn: বৈদ্যত্তুন পথ্য বেজ।

# proverb14
source: Maje na chhene jal, bondhay na chhene hal.
bn: মাজে ন চিনে জাল, বন্ধায় ন চিনে হাল।

# proverb15
source: Jar hame jare saje, ar hame ladi mare.
bn: যার হামে যারে সাজে, আর হামে লাদি মারে।

# proverb16
source: Je madit ajar hay, se madit bhor di udona.
bn: যে মাদিট আজার হায়, সে মাদিত ভর দি উদোনা।

# proverb17
source: Rupor hala, gune bhala.
bn: রূপো হালা, গুনে ভালা।

# proverb18
source: Sap oi fude, oja oi jhare.
bn: সাপ ওই ফুদে, ওজা ওই ঝারে।

# proverb19
source: Suj bharade bharade hurul bharana.
bn: সুজ ভরাদে ভরাদে হুরোল ভরানা।

# proverb20
source: Uno hele duno bol.
bn: উনো হেলে দুনো বল।

# proverb21
source: Jormottun dhormo dangor.
bn: জর্মত্তুন ধর্ম দাঙর।

# proverb22
source: Hed yeijay hugur bhugona.
bn: হেদ্‌ যেইজায় হুগুর ভুগোনা।

# proverb23
source: Atte atte nala, gade gade gola.
bn: আত্তে আত্তে নলা, গাদে গাদে গলা।

# proverb24
source: Ranga hadiyanou dhoy para, bor gung o chai para.
bn: রাঙা হাদিয়ানও ধয় পারা, বড় গাঙ ও চাই পারা।

# proverb25
source: Bap cha put cha, ma cha jhi cha.
bn: বাপ চা পুত চা, মা চা ঝি চা।

# proverb26
source: Gaz chhene bagle, manij chhene agle.
bn: গাজ চিনে বাগলে, মানিজ চিনে আগলে।

# proverb27
source: Guiyo hobal surungot, bandor hobal taregont.
bn: গুইয়ো হবাল সুরুঙত, বান্দর হবাল তারেঙত।

# proverb28
source: Di dhakke seredi panite porana.
bn: দি ধাক্কে সেরেদি পানিত পরানা।

# proverb29
source: Saghi sade sade jhul shugona.
bn: সাগি সাদে সাদে ঝুল শুগোনা।

# proverb30
source: Echhe bada hellye s.
bn: এচ্ছে বদা হেল্ল্যে স।

# proverb31
source: Ebo madattun bijol n yeje gori bor bor hada.
bn: এব মাদাত্তুন বিজল ন যেয়ে গরি বড় বড় হদা।

# proverb32
source: Chadore benge ghinei, benger chade ghinei.
bn: চাদরে বেঙে ঘিনেই, বেঙরে চাদে ঘিনেই।

# proverb33
source: Por jagat sep phelanaw dhor.
bn: পর জাগাত সেপ ফেলানাও ধর।

# proverb34
source: Nuo nuo bangri nuo nuo rong, puron ale phele diong.
bn: নুও নুও বাঙরি নুও নুও রঙ, পুরন অলে ফেলে দিওং.
